# Rebar Crank Type Utils Get Crank Length Multiplier Method

Source: https://www.revitapidocs.com/2026/e815115c-8373-e0f9-94d4-c9a2ca4cd35e.htm

---

| Rebar Crank Type Utils Get Crank Length Multiplier Method |
| --- |

Gets the crank length multiplier value.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static double GetCrankLengthMultiplier(
	Document document,
	ElementId rebarCrankTypeId
)
```

```
Public Shared Function GetCrankLengthMultiplier (
	document As Document,
	rebarCrankTypeId As ElementId
) As Double
```

```
public:
static double GetCrankLengthMultiplier(
	Document^ document,
	ElementId^ rebarCrankTypeId
)
```

```
static member GetCrankLengthMultiplier :
        document : Document *
        rebarCrankTypeId : ElementId -> float
```

#### Parameters

document Document
:   The document.

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.

#### Return Value

Double
Returns the crank length multiplier value. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarCrankTypeUtils Class Autodesk.Revit.DB.Structure Namespace